import random
# 1. Напишите функцию (F): на вход список имен и целое число N; на выходе список длины N случайных имен из первого списка (могут повторяться,
# можно взять значения: количество имен 20, N = 100,
# рекомендуется использовать функцию random);

def choisename(*args, N):
    for i in range(101):
        index=random.randint(i)
        list.append(list2,list1(index))
    return list2

list3=['Bdfy','Ivan']

# list2=choisename(list3, 100)
N=100
choisename(list3, 100)

print (list2)